Tekla Open API Reference for Tekla Structures 2025
RebarSplitter Properties
The RebarSplitter type exposes the following members.
Properties
Name | Description
BarsAffected
 Gets or sets the reinforcing bars affected.
 (Inherited from BaseRebarModifier.)
Cranking
 Gets or sets the rebar cranking.
Curve
 Gets or sets the geometric Contour of the rebar modifier.
 (Inherited from BaseRebarModifier.)
Father
 Gets or sets the RebarSet to which the modifier belongs. Only reinforcing bars generated by this RebarSet can be modified by this rebar modifier.
 (Inherited from BaseRebarModifier.)
FirstAffectedBar
 Gets or sets the first affected bar. If set to zero, the first affected bar will be chosen automatically.
 (Inherited from BaseRebarModifier.)
FollowEdges
 Gets or sets a flag that indicates whether the modifier should attempt to follow the leg face edges located between its end points.
 (Inherited from BaseRebarModifier.)
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
Lapping
 Gets or sets the rebar lapping.
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
SplitOffset
 Gets or sets the offset of the split from the location of the rebar splitter.
SplitType
 Gets or sets the split type.
StaggerOffset
 Gets or sets the additional offset (stagger) of the split location for every other split reinforcing bar.
StaggerType
 Gets or sets the stagger type.
Top
See Also
Reference
RebarSplitter Class
Tekla.Structures.Model Namespace